# GetColor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency..::..GetColor Method
ColorWithTransparency Class See Also
---
get color
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Color GetColor()
```

Visual Basic
---
```text
Public Function GetColor As Color
```

Visual C++
---
```text
public:
Color^ GetColor()
```

# ### Return Value
color
# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace